app/Controllers/Employe.php

SELECT COUNT(*) AS `numrows`
FROM `employes`
WHERE `actif` = 1
SELECT COUNT(*) AS `numrows`
FROM `conges`
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'en_attente'
SELECT COUNT(*) AS `numrows`
FROM `conges`
WHERE `statut` = 'approuvee'
AND `date_demande` >= '2026-05-01'
AND `date_demande` <= '2026-05-31'
SELECT COUNT(*) AS `numrows`
FROM `departements`
SELECT *
FROM `conges`
WHERE `statut` = 'approuvee'
AND `date_debut` <= '2026-05-13'
AND `date_fin` >= '2026-05-13'
---
    public function dashboardAdmin()
    {
        $employeModel = new \App\Models\EmployesModel();
        $congeModel = new \App\Models\CongeModel();

        // employees
        $totalEmployees = $employeModel->where('actif', 1)->countAllResults();

        // requests
        $totalRequests = $congeModel->countAllResults();
        $pending = $congeModel->where('statut', 'en_attente')->countAllResults();

        // approved this month
        $start = date('Y-m-01');
        $end = date('Y-m-t');
        $approvedThisMonth = $congeModel->where('statut', 'approuvee')
            ->where('date_demande >=', $start)
            ->where('date_demande <=', $end)
            ->countAllResults();

        // departments
        $db = \Config\Database::connect();
        $departments = $db->table('departements')->countAllResults();

        // absents today
        $today = date('Y-m-d');
        $absentConges = $congeModel->where('statut', 'approuvee')
            ->where('date_debut <=', $today)
            ->where('date_fin >=', $today)
            ->findAll();

SELECT *
FROM `conges`
ORDER BY `date_demande` DESC
 LIMIT 10
SELECT *
FROM `employes`
WHERE `employes`.`id` = 4
---
        }

        // recent requests
        $recentRaw = $congeModel->orderBy('date_demande', 'DESC')->findAll(10);
        $recent = [];
        foreach ($recentRaw as $r) {
            $emp = $employeModel->find((int)$r['employe_id']) ?: [];