app/Controllers/Employe.php

    public function index()
    {
        $data = [
            'title' => 'Liste des employes',
            'employes' => $this->employesModel->getEmployesList(),
            'totalEmployes' => $this->employesModel->countAllResults(),
        ];
---
SELECT COUNT(*) AS `numrows`
FROM `employes`