app/Controllers/User.php

SELECT *
FROM `users`
WHERE `users`.`id` = 1
---
    public function valeurportefeuille(){
        $userId = (int) $this->session->get('user_id');
        if (!$userId) {
            return redirect()->to('/');
        }

        $user = $this->userModel->find($userId);