app/Models/CongeModel.php

    public function getByEmployee(int $employeId): array
    {
        return $this->where('employe_id', $employeId)
            ->orderBy('date_demande', 'DESC')
            ->findAll();
---
SELECT *
FROM `conges`
WHERE `employe_id` = 4
ORDER BY `date_demande` DESC

    public function getSummaryByEmployee(int $employeId): array
    {
        $db = $this->db;
        $builder = $db->table($this->table);

        $counts = $builder
            ->select('statut, COUNT(*) as cnt')
            ->where('employe_id', $employeId)
            ->groupBy('statut')
            ->get()
            ->getResultArray();

        $summary = ['en_attente' => 0, 'accepte' => 0, 'refuse' => 0];
        foreach ($counts as $r) {
            $summary[$r['statut']] = (int) $r['cnt'];
        }

        // soldes: compute total remaining days across types for current year
        $year = (int) date('Y');
        $soldes = $db->table('soldes')
            ->select('type_conge_id, jours_attribues, jours_pris')
            ->where(['employe_id' => $employeId, 'annee' => $year])
            ->get()
            ->getResultArray();
---
SELECT `statut`, COUNT(*) as cnt
FROM `conges`
WHERE `employe_id` = 4
GROUP BY `statut`
SELECT `type_conge_id`, `jours_attribues`, `jours_pris`
FROM `soldes`
WHERE `employe_id` = 4
AND `annee` = 2026