app/Models/EmployesModel.php

    public function getEmployesList(): array
    {
        return $this->select('employes.id, employes.nom, employes.prenom, employes.email, employes.role, employes.date_embauche, employes.actif, departements.nom AS departement_nom')
            ->join('departements', 'departements.id = employes.departement_id', 'left')
            ->orderBy('employes.id', 'ASC')
            ->findAll();
---
SELECT `employes`.`id`, `employes`.`nom`, `employes`.`prenom`, `employes`.`email`, `employes`.`role`, `employes`.`date_embauche`, `employes`.`actif`, `departements`.`nom` AS `departement_nom`
FROM `employes`
LEFT JOIN `departements` ON `departements`.`id` = `employes`.`departement_id`
ORDER BY `employes`.`id` ASC

    public function findByEmail(string $email): ?array
    {
        $employe = $this->where('email', $email)->first();
---
SELECT *
FROM `employes`
WHERE `email` = 'john.doe@gmail.com'
 LIMIT 1