app/Models/SoldeModel.php

SELECT *
FROM `soldes`
WHERE `employe_id` = 4
AND `annee` = 2026
---
    public function forEmployeeYear(int $employeId, int $year)
    {
        return $this->where(['employe_id' => $employeId, 'annee' => $year])->findAll();