app/Models/TypeCongeModel.php

    public function getAll()
    {
        return $this->orderBy('id')->findAll();
---
SELECT *
FROM `type_conges`
ORDER BY `id`