app/Models/UserModel.php

    public function findByEmail(string $email): ?array
    {
        $user = $this->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'test@gmail.com'
 LIMIT 1